Documents/А_ПриходДенегОтФинАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ПриходДенегОтФинАгента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_ФинАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссииФА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ВведенВЕРП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Необновлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатратКомиссия</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_СтатьяДвиженияДенежныхСредствКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКазна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_НеСовпадаетПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>А_РасшифровкаФинАгент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФинАгент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ФинАгенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииФА</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокСписаниеБезналичныхДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>А_ПроцентФинАгента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/А_ДенежныеСредстваФинАгенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДенежныеСредстваФинАгенты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСКомиссией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_ФинАгенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныеБаллы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыПриемкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыПриемкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазделенаПоЗаказамИНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРазделенаПоЗаказамИНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МожетПроисходитьБезЗаказовИНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазделенаТолькоПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРазделенаПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамБезЗаказовИНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамПослеЗаказовИлиНакладных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамПослеНакладных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяВРаспоряжении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/А_ПриходДенегОтФинАгента/Ext/ObjectModule.bsl
//***ERP

Процедура ОбновитьПриходДенегОтФинАгентаПослеОбмена() Экспорт

	Если А_Обработан Тогда

		Возврат;

	КонецЕсли;


	ПодразделениеШапка = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(А_НаправлениеДеятельности,А_Подразделение);
	СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001082");   //Поступление от Фин агента
   	СтатьяЗатратКомиссия = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("100000032");// РКО_Плата за розрахунково-касове обслуговування й інші послуги банків
    НоменклатураЗатрат = Справочники.Номенклатура.НайтиПоКоду("00-00000326");  //Юридичні послуги
    Подразделение = ПодразделениеШапка;
	
	РасшифровкаПлатежа.Очистить();


    А_НеСовпадаетПодразделение = Ложь;
	СуммаДокумента = А_РасшифровкаФинАгент.Итог("Сумма")+А_РасшифровкаФинАгент.Итог("СуммаКомиссииФА");
	СуммаКомиссииФА = А_РасшифровкаФинАгент.Итог("СуммаКомиссииФА");
	Для каждого СтрокаТЗ Из А_РасшифровкаФинАгент Цикл
		А_ПроцентФинАгентаПлатежка = СтрокаТЗ.ДокументПередачи.А_ПроцентФинАгента;
		СуммаФинАгентСтрока =  СтрокаТЗ.Сумма+ СтрокаТЗ.СуммаКомиссииФА;
		СуммаКомиссииСтрока =  СтрокаТЗ.СуммаКомиссииФА;
		Для каждого СтрокаПлатежки Из СтрокаТЗ.ДокументПередачи.РасшифровкаПлатежа Цикл

			Если СуммаФинАгентСтрока=0 Тогда
				Прервать;
			КонецЕсли;

			Контрагент = СтрокаТЗ.ДокументПередачи.Контрагент;

			СуммаКСписанию = Мин(СуммаФинАгентСтрока,СтрокаПлатежки.Сумма);
			СуммаФинАгентСтрока = СуммаФинАгентСтрока - СуммаКСписанию;

			СуммаКомиссии = Окр(А_ПроцентФинАгентаПлатежка*СуммаКСписанию/100,2);

			СуммаКСписаниюКомиссии = Мин(СуммаКомиссииСтрока,СуммаКомиссии);
			СуммаКомиссииСтрока = СуммаКомиссииСтрока - СуммаКСписаниюКомиссии;

			СтрокаРасшифровкаПлатежа = РасшифровкаПлатежа.Добавить();
			СтрокаРасшифровкаПлатежа.Контрагент = Контрагент;
			СтрокаРасшифровкаПлатежа.Сумма = СуммаКСписанию;
			СтрокаРасшифровкаПлатежа.СуммаКомиссии = СуммаКСписаниюКомиссии;
			СтрокаРасшифровкаПлатежа.ДокСписаниеБезналичныхДенежныхСредств = СтрокаТЗ.ДокументПередачи;
			СтрокаРасшифровкаПлатежа.А_ПроцентФинАгента = СтрокаТЗ.ДокументПередачи.А_ПроцентФинАгента;
			СтрокаРасшифровкаПлатежа.ОбъектРасчетов = СтрокаПлатежки.ОбъектРасчетов;
            СтрокаРасшифровкаПлатежа.Подразделение  = СтрокаТЗ.ДокументПередачи.Подразделение;
			Если СтрокаРасшифровкаПлатежа.Подразделение <> Подразделение Тогда
			
				А_НеСовпадаетПодразделение = Истина;
			
			КонецЕсли;
		КонецЦикла;

		Если СуммаФинАгентСтрока>0 И РасшифровкаПлатежа.Количество()>0 Тогда

			СтрокаРасшифровкаПлатежа.Сумма = СтрокаРасшифровкаПлатежа.Сумма + СуммаФинАгентСтрока;
			СтрокаРасшифровкаПлатежа.СуммаКомиссии = СтрокаРасшифровкаПлатежа.СуммаКомиссии + СуммаКомиссииСтрока;
		КонецЕсли;


	КонецЦикла;




	А_Обработан = Истина;

КонецПроцедуры
//***ERP

// ==============================================================================
// Вспомогательные процедуры для СоздатьПриходДенегПоФинАгенту
// ==============================================================================

Процедура ЗаполнитьПКО(ДокОбъект, ДатаДокумента, Организация, Касса, Валюта,
		СтрКонтрагент, СтрПартнер, СтрСумма, СтатьяДДС, ПодразделениеДок,
		НаправлениеДеятельности, ДокОснование, СтрНомерСтроки,
		СтрПроцентФинАгента, СтрСуммаКомиссии, СтрОбъектРасчетов)

	ДокОбъект.Дата                           = ДатаДокумента+1;
	ДокОбъект.Организация                    = Организация;
	ДокОбъект.ХозяйственнаяОперация          = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;
	ДокОбъект.А_ОбработанКазна               = Истина;
	ДокОбъект.Касса                           = Касса;
	ДокОбъект.Контрагент                      = СтрКонтрагент;
	ДокОбъект.Партнер                         = СтрПартнер;
	ДокОбъект.Валюта                          = Валюта;
	ДокОбъект.СуммаДокумента                  = СтрСумма;
	ДокОбъект.СтатьяДвиженияДенежныхСредств   = СтатьяДДС;
	ДокОбъект.Подразделение                   = ПодразделениеДок;
	ДокОбъект.НаправлениеДеятельности         = НаправлениеДеятельности;
	// Связки
	ДокОбъект.А_ПриходДенегОтФинАгента       = ДокОснование;
	ДокОбъект.А_КодСтрокиПриходДенегОтФинАгента = СтрНомерСтроки;
	// Кастомные поля
	ДокОбъект.А_НаправлениеДеятельности       = НаправлениеДеятельности;
	ДокОбъект.А_Подразделение                 = ПодразделениеДок;
	ДокОбъект.А_ПроцентФинАгента              = СтрПроцентФинАгента;
	ДокОбъект.А_СуммаКомиссии                 = СтрСуммаКомиссии;

	// ТЧ РасшифровкаПлатежа
	ДокОбъект.РасшифровкаПлатежа.Очистить();
	СтрокаРП = ДокОбъект.РасшифровкаПлатежа.Добавить();
	СтрокаРП.Партнер                          = СтрПартнер;
	СтрокаРП.Сумма                            = СтрСумма;
	СтрокаРП.СуммаВзаиморасчетов              = СтрСумма;
	СтрокаРП.ВалютаВзаиморасчетов             = Валюта;
	СтрокаРП.СтатьяДвиженияДенежныхСредств    = СтатьяДДС;
	СтрокаРП.Подразделение                    = ПодразделениеДок;
	СтрокаРП.НаправлениеДеятельности          = НаправлениеДеятельности;
	Если ЗначениеЗаполнено(СтрОбъектРасчетов) Тогда
		СтрокаРП.ОбъектРасчетов               = СтрОбъектРасчетов;  
		ДокОбъект.Договор                     = СтрОбъектРасчетов.Договор;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРКО(ДокОбъект, ДатаДокумента, Организация, Касса, Валюта,
		СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, СтатьяДДС, ПодразделениеДок,
		НаправлениеДеятельности, ДокОснование, СсылкаПКО, СтрОбъектРасчетов)

	ДокОбъект.Дата                           = ДатаДокумента+2;
	ДокОбъект.Организация                    = Организация;
	ДокОбъект.ХозяйственнаяОперация          = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
	ДокОбъект.А_ОбработанКазна               = Истина;
	ДокОбъект.Касса                           = Касса;
	ДокОбъект.Контрагент                      = СтрКонтрагент;
	ДокОбъект.Партнер                         = СтрПартнер;
	ДокОбъект.Валюта                          = Валюта;
	ДокОбъект.СуммаДокумента                  = СтрСуммаКомиссии;
	ДокОбъект.СтатьяДвиженияДенежныхСредств   = СтатьяДДС;
	ДокОбъект.Подразделение                   = ПодразделениеДок;
	ДокОбъект.НаправлениеДеятельности         = НаправлениеДеятельности;
	// Связки
	ДокОбъект.А_ПриходДенегОтФинАгента       = ДокОснование;
	ДокОбъект.А_ПриходныйКассовыйОрдерОтФинАгента = СсылкаПКО;

	// ТЧ РасшифровкаПлатежа
	ДокОбъект.РасшифровкаПлатежа.Очистить();
	СтрокаРП = ДокОбъект.РасшифровкаПлатежа.Добавить();
	СтрокаРП.Сумма                           = СтрСуммаКомиссии;
	СтрокаРП.СуммаВзаиморасчетов              = СтрСуммаКомиссии;
	СтрокаРП.ВалютаВзаиморасчетов             = Валюта;
	СтрокаРП.СтатьяДвиженияДенежныхСредств    = СтатьяДДС;
	СтрокаРП.Подразделение                    = ПодразделениеДок;
	СтрокаРП.НаправлениеДеятельности          = НаправлениеДеятельности;
	СтрокаРП.Партнер                          = СтрПартнер;
	Если ЗначениеЗаполнено(СтрОбъектРасчетов) Тогда
		СтрокаРП.ОбъектРасчетов              = СтрОбъектРасчетов; 
		ДокОбъект.Договор                    = СтрОбъектРасчетов.Договор;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПриобретение(ДокОбъект, ДатаДокумента, Организация, Валюта,
		СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, ПодразделениеДок,
		НаправлениеДеятельности, ДокОснование, СсылкаПКО, СтрДоговор,
		НоменклатураЗатратДок, СтатьяЗатратДок, СтрОбъектРасчетов)

	ДокОбъект.Дата                          = ДатаДокумента+3;
	ДокОбъект.Организация                   = Организация;
	ДокОбъект.Контрагент                    = СтрКонтрагент;
	ДокОбъект.Партнер                       = СтрПартнер;
	ДокОбъект.ХозяйственнаяОперация         = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокОбъект.А_ВведенВЕРП                  = Истина;
	ДокОбъект.Валюта                        = Валюта;
	ДокОбъект.ВалютаВзаиморасчетов           = Валюта;
	ДокОбъект.СуммаДокумента                = СтрСуммаКомиссии;
	ДокОбъект.Курс                          = 1;
	ДокОбъект.Кратность                     = 1;
	ДокОбъект.ЦенаВключаетНДС               = Истина;
	ДокОбъект.СуммаВзаиморасчетов            = СтрСуммаКомиссии;
	ДокОбъект.Подразделение                  = СтрДоговор.Подразделение;
	ДокОбъект.НаправлениеДеятельности        = НаправлениеДеятельности;
	ДокОбъект.ФормаОплаты                    = Перечисления.ФормыОплаты.Наличная;   
	ДокОбъект.А_Обработан = Истина;
	ДокОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ДокОбъект.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;

		ДокОбъект.Договор                   = СтрДоговор; 
		
	// Связки
	ДокОбъект.А_ПриходДенегОтФинАгента     = ДокОснование;
	ДокОбъект.А_ПриходныйКассовыйОрдерКомиссия = СсылкаПКО;
	// Если ОбъектРасчетов.Объект = ЗаказПоставщику
	Если ЗначениеЗаполнено(СтрОбъектРасчетов)
		И ТипЗнч(СтрОбъектРасчетов.Объект) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокОбъект.ПоступлениеПоЗаказам       = Истина;
		ДокОбъект.ЗаказПоставщику             = СтрОбъектРасчетов.Объект;
	КонецЕсли;

	// ТЧ Товары
	ДокОбъект.Товары.Очистить();
	НоваяСтрТовары = ДокОбъект.Товары.Добавить();
	НоваяСтрТовары.Номенклатура              = НоменклатураЗатратДок;
	НоваяСтрТовары.СтатьяРасходов            = СтатьяЗатратДок;
	НоваяСтрТовары.Количество                = 1;
	НоваяСтрТовары.КоличествоУпаковок        = 1;
	НоваяСтрТовары.Цена                      = СтрСуммаКомиссии;
	НоваяСтрТовары.Сумма                     = СтрСуммаКомиссии;
	НоваяСтрТовары.СуммаСНДС                 = СтрСуммаКомиссии;
	НоваяСтрТовары.СуммаВзаиморасчетов       = СтрСуммаКомиссии;
	НоваяСтрТовары.СтавкаНДС                 = Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");
	НоваяСтрТовары.СуммаНДС                  = 0;
	НоваяСтрТовары.СписатьНаРасходы           = Истина;
	НоваяСтрТовары.КодСтроки                 = 1;
	НоваяСтрТовары.ИдентификаторСтроки        = Строка(Новый УникальныйИдентификатор);
	НоваяСтрТовары.Подразделение          = ДокОбъект.Подразделение;
	Если ЗначениеЗаполнено(СтрОбъектРасчетов) Тогда
		НоваяСтрТовары.ОбъектРасчетов         = СтрОбъектРасчетов;
		Если ТипЗнч(СтрОбъектРасчетов.Объект) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			НоваяСтрТовары.ЗаказПоставщику    = СтрОбъектРасчетов.Объект;
		КонецЕсли;
	КонецЕсли;

	// ТЧ РасшифровкаПлатежа
	ДокОбъект.РасшифровкаПлатежа.Очистить();
    ДокОбъект.ВидыЗапасов.Очистить();
	ДокОбъект.ЭтапыГрафикаОплаты.Очистить();


КонецПроцедуры

Функция ОчиститьДочерниеДокументыФинАгент(ДокОснование, ИмяТипаДок)

	ЗапросОчистки = Новый Запрос;
	ЗапросОчистки.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Проведен КАК Проведен,
	|	Док.Номер КАК Номер
	|ИЗ
	|	Документ." + ИмяТипаДок + " КАК Док
	|ГДЕ
	|	Док.А_ПриходДенегОтФинАгента = &Основание
	|	И НЕ Док.ПометкаУдаления";
	ЗапросОчистки.УстановитьПараметр("Основание", ДокОснование);

	Кол = 0;
	РезОчистки = ЗапросОчистки.Выполнить();
	Если НЕ РезОчистки.Пустой() Тогда
		ВыбОчистки = РезОчистки.Выбрать();
		Пока ВыбОчистки.Следующий() Цикл
			Попытка
				ДокОбъектОчистки = ВыбОчистки.Ссылка.ПолучитьОбъект();
				Если ВыбОчистки.Проведен Тогда
					ДокОбъектОчистки.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокОбъектОчистки.УстановитьПометкуУдаления(Истина);
				Кол = Кол + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка очистки " + ИмяТипаДок + " " + ВыбОчистки.Номер
					+ ": " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	Возврат Кол;

КонецФункции

// ==============================================================================
// ОСНОВНАЯ ПРОЦЕДУРА: создание веера дочерних документов
// ==============================================================================

Процедура СоздатьПриходДенегПоФинАгенту() Экспорт

	ДокОснование = Ссылка;

	// ========== ФАЗА 1: ОЧИСТКА (пометка на удаление + отмена проведения) ==========
	КолОчисткаПриобр = ОчиститьДочерниеДокументыФинАгент(ДокОснование, "ПриобретениеТоваровУслуг");
	КолОчисткаРКО    = ОчиститьДочерниеДокументыФинАгент(ДокОснование, "РасходныйКассовыйОрдер");
	КолОчисткаПКО    = ОчиститьДочерниеДокументыФинАгент(ДокОснование, "ПриходныйКассовыйОрдер");

	// ========== ПРОВЕРКА: источник проведён? ==========
	Если НЕ Проведен Тогда
		Возврат;
	КонецЕсли;

	// ========== ЧТЕНИЕ ШАПКИ (прямо из атрибутов объекта) ==========
	ДатаДокумента           = НачалоДня(Дата);
	ОрганизацияДок          = Организация;
	КассаДок                = Касса;
	СтатьяДДС               = СтатьяДвиженияДенежныхСредств;
	НоменклатураЗатратДок    = НоменклатураЗатрат;
	СтатьяЗатратДок          = СтатьяЗатратКомиссия;
	ПодразделениеДок         = Подразделение;
	НаправлениеДеятельностиДок = А_НаправлениеДеятельности;

	ВалютаДок = Касса.ВалютаДенежныхСредств;
	Если НЕ ЗначениеЗаполнено(ВалютаДок) Тогда
		ВалютаДок = Справочники.Валюты.НайтиПоКоду("980");
	КонецЕсли;

	// ========== ЦИКЛ ПО СТРОКАМ РАСШИФРОВКИ ==========
	КолСозданоПКО      = 0;
	КолОбновленоПКО    = 0;
	КолСозданоРКО      = 0;
	КолОбновленоРКО    = 0;
	КолСозданоПриобр   = 0;
	КолОбновленоПриобр = 0;

	Для Каждого СтрРП Из РасшифровкаПлатежа Цикл

		Если СтрРП.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрКонтрагент       = СтрРП.Контрагент;
		СтрОбъектРасчетов   = СтрРП.ОбъектРасчетов;
		СтрСумма            = СтрРП.Сумма;
		СтрСуммаКомиссии    = СтрРП.СуммаКомиссии;
		СтрНомерСтроки      = СтрРП.НомерСтроки;
		СтрПроцентФинАгента = СтрРП.А_ПроцентФинАгента;

		// Партнёр
		СтрПартнер = Неопределено;
		Попытка
			СтрПартнер = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(СтрКонтрагент);
		Исключение
			ЗапросПартнер = Новый Запрос;
			ЗапросПартнер.Текст = "ВЫБРАТЬ Партнер ИЗ Справочник.Контрагенты ГДЕ Ссылка = &К";
			ЗапросПартнер.УстановитьПараметр("К", СтрКонтрагент);
			РезП = ЗапросПартнер.Выполнить();
			Если НЕ РезП.Пустой() Тогда
				ВыбП = РезП.Выбрать();
				ВыбП.Следующий();
				СтрПартнер = ВыбП.Партнер;
			КонецЕсли;
		КонецПопытки;

			
		СтрДоговор=СтрОбъектРасчетов.Договор;
		
		// ===== ПКО: ПОИСК → обновить / создать =====
		СсылкаПКО = Неопределено;

		ЗапросПКО = Новый Запрос;
		ЗапросПКО.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Док.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК Док
		|ГДЕ
		|	Док.А_ПриходДенегОтФинАгента = &Основание
		|	И Док.А_КодСтрокиПриходДенегОтФинАгента = &НомерСтроки";
		ЗапросПКО.УстановитьПараметр("Основание", ДокОснование);
		ЗапросПКО.УстановитьПараметр("НомерСтроки", СтрНомерСтроки);

		РезПКО = ЗапросПКО.Выполнить();

		Если НЕ РезПКО.Пустой() Тогда
			ВыбПКО = РезПКО.Выбрать();
			ВыбПКО.Следующий();
			Попытка
				ДокОбъектПКО = ВыбПКО.Ссылка.ПолучитьОбъект();
				ДокОбъектПКО.УстановитьПометкуУдаления(Ложь);
				ЗаполнитьПКО(ДокОбъектПКО, ДатаДокумента, ОрганизацияДок, КассаДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСумма, СтатьяДДС, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СтрНомерСтроки,
					СтрПроцентФинАгента, СтрСуммаКомиссии, СтрОбъектРасчетов);
				ДокОбъектПКО.Записать(РежимЗаписиДокумента.Проведение);
				СсылкаПКО = ДокОбъектПКО.Ссылка;
				КолОбновленоПКО = КолОбновленоПКО + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА обновления ПКО строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
		Иначе
			Попытка
				НовыйПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
				ЗаполнитьПКО(НовыйПКО, ДатаДокумента, ОрганизацияДок, КассаДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСумма, СтатьяДДС, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СтрНомерСтроки,
					СтрПроцентФинАгента, СтрСуммаКомиссии, СтрОбъектРасчетов);
				НовыйПКО.Записать(РежимЗаписиДокумента.Проведение);
				СсылкаПКО = НовыйПКО.Ссылка;
				КолСозданоПКО = КолСозданоПКО + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА создания ПКО строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
		КонецЕсли;

		// РКО и Приобретение только если есть комиссия
		Если СтрСуммаКомиссии <= 0 Тогда
			Продолжить;
		КонецЕсли;

		// ===== РКО: ПОИСК → обновить / создать =====
		ЗапросРКО = Новый Запрос;
		ЗапросРКО.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Док.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК Док
		|ГДЕ
		|	Док.А_ПриходДенегОтФинАгента = &Основание
		|	И Док.А_ПриходныйКассовыйОрдерОтФинАгента = &СсылкаПКО";
		ЗапросРКО.УстановитьПараметр("Основание", ДокОснование);
		ЗапросРКО.УстановитьПараметр("СсылкаПКО", СсылкаПКО);

		РезРКО = ЗапросРКО.Выполнить();

		Если НЕ РезРКО.Пустой() Тогда
			ВыбРКО = РезРКО.Выбрать();
			ВыбРКО.Следующий();
			Попытка
				ДокОбъектРКО = ВыбРКО.Ссылка.ПолучитьОбъект();
				ДокОбъектРКО.УстановитьПометкуУдаления(Ложь);
				ЗаполнитьРКО(ДокОбъектРКО, ДатаДокумента, ОрганизацияДок, КассаДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, СтатьяДДС, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СсылкаПКО, СтрОбъектРасчетов);
				ДокОбъектРКО.Записать(РежимЗаписиДокумента.Проведение);
				КолОбновленоРКО = КолОбновленоРКО + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА обновления РКО строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Попытка
				НовыйРКО = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
				ЗаполнитьРКО(НовыйРКО, ДатаДокумента, ОрганизацияДок, КассаДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, СтатьяДДС, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СсылкаПКО, СтрОбъектРасчетов);
				НовыйРКО.Записать(РежимЗаписиДокумента.Проведение);
				КолСозданоРКО = КолСозданоРКО + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА создания РКО строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;

		// ===== Приобретение: ПОИСК → обновить / создать =====
		ЗапросПриобр = Новый Запрос;
		ЗапросПриобр.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Док.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК Док
		|ГДЕ
		|	Док.А_ПриходДенегОтФинАгента = &Основание
		|	И Док.А_ПриходныйКассовыйОрдерКомиссия = &СсылкаПКО";
		ЗапросПриобр.УстановитьПараметр("Основание", ДокОснование);
		ЗапросПриобр.УстановитьПараметр("СсылкаПКО", СсылкаПКО);

		РезПриобр = ЗапросПриобр.Выполнить();

		Если НЕ РезПриобр.Пустой() Тогда
			ВыбПриобр = РезПриобр.Выбрать();
			ВыбПриобр.Следующий();
			Попытка
				ДокОбъектПриобр = ВыбПриобр.Ссылка.ПолучитьОбъект();
				ДокОбъектПриобр.УстановитьПометкуУдаления(Ложь);
				ЗаполнитьПриобретение(ДокОбъектПриобр, ДатаДокумента, ОрганизацияДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СсылкаПКО, СтрДоговор,
					НоменклатураЗатратДок, СтатьяЗатратДок, СтрОбъектРасчетов);
					ДокОбъектПриобр.Записать(РежимЗаписиДокумента.Проведение);
				КолОбновленоПриобр = КолОбновленоПриобр + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА обновления Приобретения строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Попытка
				НовоеПриобр = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
				ЗаполнитьПриобретение(НовоеПриобр, ДатаДокумента, ОрганизацияДок, ВалютаДок,
					СтрКонтрагент, СтрПартнер, СтрСуммаКомиссии, ПодразделениеДок,
					НаправлениеДеятельностиДок, ДокОснование, СсылкаПКО, СтрДоговор,
					НоменклатураЗатратДок, СтатьяЗатратДок, СтрОбъектРасчетов);
				НовоеПриобр.Записать(РежимЗаписиДокумента.Проведение);
				КолСозданоПриобр = КолСозданоПриобр + 1;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА создания Приобретения строка " + Строка(СтрНомерСтроки)
					+ ": " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;

	// ========== ИТОГОВОЕ СООБЩЕНИЕ ==========
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("СоздатьПриходДенегПоФинАгенту: ПКО=" + Строка(КолСозданоПКО) + "/" + Строка(КолОбновленоПКО)
		+ ", РКО=" + Строка(КолСозданоРКО) + "/" + Строка(КолОбновленоРКО)
		+ ", Приобр=" + Строка(КолСозданоПриобр) + "/" + Строка(КолОбновленоПриобр));

КонецПроцедуры

// ==============================================================================
// Проведение по регистру А_ДенежныеСредстваФинАгенты
// ==============================================================================

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.А_ДенежныеСредстваФинАгенты.Записывать = Истина;
	Движения.А_ДенежныеСредстваФинАгенты.Очистить();
	
	Для Каждого СтрокаРП Из РасшифровкаПлатежа Цикл
		
		Если СтрокаРП.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.А_ДенежныеСредстваФинАгенты.Добавить();
		Движение.ВидДвижения            = ВидДвиженияНакопления.Расход;
		Движение.Период                 = Дата;
		Движение.ФинАгент               = ФинАгент;
		Движение.ДокументПередачи       = СтрокаРП.ДокСписаниеБезналичныхДенежныхСредств;
		Движение.НаправлениеДеятельности = СтрокаРП.Подразделение.А_НаправлениеДеятельности;
		Движение.Подразделение           = СтрокаРП.Подразделение;
		Движение.Контрагент             = СтрокаРП.Контрагент;
		Движение.ДоговорКонтрагента     = СтрокаРП.ОбъектРасчетов.Договор;
		Движение.ОбъектРасчетов         = СтрокаРП.ОбъектРасчетов;
		Движение.Сумма                  = СтрокаРП.Сумма - СтрокаРП.СуммаКомиссии;
		Движение.СуммаКомиссии          = СтрокаРП.СуммаКомиссии;
		Движение.СуммаСКомиссией        = СтрокаРП.Сумма ;
		
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.А_ДенежныеСредстваФинАгенты.Записывать = Истина;
	Движения.А_ДенежныеСредстваФинАгенты.Очистить();

КонецПроцедуры

// ==============================================================================
// Стандартные обработчики событий
// ==============================================================================

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		//***ERP
	ОбновитьПриходДенегОтФинАгентаПослеОбмена();
	//***ERP


	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СоздатьПриходДенегПоФинАгенту();

КонецПроцедуры
